import { sweep } from './sweep';

describe('utils/sweep', () => {
  it('2次元配列の全てが0以外で埋まった行を削除し、先頭に0で埋めた行を追加する', () => {
    expect(
      sweep([
        [0, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 2, 0, 0],
        [1, 2, 3, 0],
        [1, 2, 3, 4],
      ]),
    ).toStrictEqual([
      [0, 0, 0, 0],
      [0, 0, 0, 0],
      [1, 0, 0, 0],
      [1, 2, 0, 0],
      [1, 2, 3, 0],
    ]);
  });

  it('2次元配列に全てが0以外で埋まった行が無い場合、そのまま返す', () => {
    expect(
      sweep([
        [0, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 2, 0, 0],
        [1, 2, 3, 0],
      ]),
    ).toStrictEqual([
      [0, 0, 0, 0],
      [1, 0, 0, 0],
      [1, 2, 0, 0],
      [1, 2, 3, 0],
    ]);
  });
});
